high-level-tests/load-testing/scenarios/signup-and-user-profile.yml
config:
  phases:
    - duration: 60
      arrivalRate: 5
    - duration: 120
      arrivalRate: 5
      rampTo: 50
    - duration: 600
      arrivalRate: 50
scenarios:
  - name: 'Inscription et positionnement'
    flow:
      - function: "setupSignupForData"

      ### ---------------------- ###
      ### From page /inscription ###
      ### ---------------------- ###

      # Submit user form
      - post:
          url: "/api/users"
          json:
            data:
              attributes:
                first-name: "{{ firstName }}"
                last-name: "{{ lastName }}"
                email: "{{ email }}"
                password: "{{ password }}"
                cgu: true
                recaptcha-token: "{{ recaptchaToken }}"
              type: "users"

      # Authenticate user
      - post:
          url: "/api/authentications"
          json:
            data:
              attributes:
                password: "{{ password }}"
                email: "{{ email }}"
          capture:
            - json: "$.data.attributes.token"
              as: "accessToken"
            - json: "$.data.id"
              as: "userId"

      # Get user profile
      - get:
          url: "/api/users/me"
          headers:
            Authorization: "Bearer {{ accessToken }}"

      # Fetch campaign participations
      - get:
          url: "/api/users/{{ userId }}/campaign-participations"
          headers:
            Authorization: "Bearer {{ accessToken }}"