high-level-tests/load-testing/scenarios/signup-only.yml
config:
  phases:
    - duration: 60
      arrivalRate: 5
    - duration: 120
      arrivalRate: 5
      rampTo: 50
    - duration: 300
      arrivalRate: 250
scenarios:
  - name: 'Inscription et positionnement'
    flow:
      - function: "setupSignupForData"

      ### ---------------------- ###
      ### From page /inscription ###
      ### ---------------------- ###

      # Submit user form
      - post:
          url: "/api/users"
          json:
            data:
              attributes:
                first-name: "{{ firstName }}"
                last-name: "{{ lastName }}"
                email: "{{ email }}"
                password: "{{ password }}"
                cgu: true
                recaptcha-token: "{{ recaptchaToken }}"
              type: "users"

      # Authenticate user
      - post:
          url: "/api/authentications"
          json:
            data:
              attributes:
                password: "{{ password }}"
                email: "{{ email }}"
          capture:
            - json: "$.data.attributes.token"
              as: "accessToken"
            - json: "$.data.id"
              as: "userId"